ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/inc/ht32l5xxxx_tm.h
#define IS_TM_OM_NOASYM(x) (((x) == TM_OM_MATCH_NOCHANGE)  || \
                            ((x) == TM_OM_MATCH_INACTIVE)  || \
                            ((x) == TM_OM_MATCH_ACTIVE)    || \
                            ((x) == TM_OM_MATCH_TOGGLE)    || \
                            ((x) == TM_OM_PWM1)            || \
                            ((x) == TM_OM_PWM2)            || \
                            ((x) == TM_OM_FORCED_INACTIVE) || \
                            ((x) == TM_OM_FORCED_ACTIVE))
/**
 * @brief Used to check parameter of the channel.
 */
#define IS_TM_CH_0(x)     (x == TM_CH_0)
#define IS_TM_CH_1(x)     (x == TM_CH_1)
#define IS_TM_CH_2(x)     (x == TM_CH_2)
#define IS_TM_CH_3(x)     (x == TM_CH_3)

#define IS_TM_CH(x)  (IS_TM_CH_0(x) || IS_TM_CH_1(x) || \
                      IS_TM_CH_2(x) || IS_TM_CH_3(x))

/**
 * @brief Used to check parameter of the channel for PWM input function.
 */
#define IS_TM_CH_PWMI(x) (((x) == TM_CH_0) || ((x) == TM_CH_1))
/**
 * @brief Used to check parameter of the clock divider.
 */
#define IS_TM_CKDIV_OFF(x) (x == TM_CKDIV_OFF)
#define IS_TM_CKDIV_2(x)   (x == TM_CKDIV_2)
#define IS_TM_CKDIV_4(x)   (x == TM_CKDIV_4)

#define IS_TM_CKDIV(x)  (IS_TM_CKDIV_OFF(x) || \
                         IS_TM_CKDIV_2(x)   || \
                         IS_TM_CKDIV_4(x))
/**
 * @brief Used to check parameter of the counter mode.
 */
#define IS_TM_CNT_MODE(x)   ((x == TM_CNT_MODE_UP) ||  \
                             (x == TM_CNT_MODE_CA1) || \
                             (x == TM_CNT_MODE_CA2) || \
                             (x == TM_CNT_MODE_CA3) || \
                             (x == TM_CNT_MODE_DOWN))
/**
 * @brief Used to check parameter of the channel polarity.
 */
#define IS_TM_CHP(x)    ((x == TM_CHP_NONINVERTED) || (x == TM_CHP_INVERTED))
/**
 * @brief Used to check parameter of the channel control.
 */
#define IS_TM_CHCTL(x)  ((x == TM_CHCTL_DISABLE) || (x == TM_CHCTL_ENABLE))
/**
 * @brief Used to check parameter of the channel capture / compare PDMA selection.
 */
#define IS_TM_CHCCDS(x) ((x == TM_CHCCDS_CHCCEV) || (x == TM_CHCCDS_UEV))
/**
 * @brief Used to check parameter of the channel input selection.
 */
#define IS_TM_CHCCS(x)  ((x == TM_CHCCS_DIRECT) || \
                           (x == TM_CHCCS_INDIRECT) || \
                           (x == TM_CHCCS_TRCED))
/**
 * @brief Used to check parameter of the channel capture prescaler.
 */
#define IS_TM_CHPSC(x)  ((x == TM_CHPSC_OFF) || \
                           (x == TM_CHPSC_2) || \
                           (x == TM_CHPSC_4) || \
                           (x == TM_CHPSC_8))
#if 0
/**
 * @brief Used to check parameter of the ETI prescaler.
 */
#define IS_TM_ETIPSC(x) ((x == TM_ETIPSC_OFF) || \
                           (x == TM_ETIPSC_2) || \
                           (x == TM_ETIPSC_4) || \
                           (x == TM_ETIPSC_8))
#endif
/**
 * @brief Used to check parameter of the TM interrupt.
 */
#define IS_TM_INT(x) (((x & 0xFF0F10F0) == 0x0) && (x != 0))
/**
 * @brief Used to check parameter of the TM PDMA request.
 */
#define IS_TM_PDMA(x) (((x & 0xFAF0FFFF) == 0x0) && (x != 0))
/**
 * @brief Used to check parameter of the TM interrupt for \ref TM_GetIntStatus function.
 */
#define IS_TM_INT_CH0CC(x) (x == TM_INT_CH0CC)
#define IS_TM_INT_CH1CC(x) (x == TM_INT_CH1CC)
#define IS_TM_INT_CH2CC(x) (x == TM_INT_CH2CC)
#define IS_TM_INT_CH3CC(x) (x == TM_INT_CH3CC)

#define IS_TM_INT_UEV(x)   (x == TM_INT_UEV)
#define IS_TM_INT_UEV2(x)  (x == TM_INT_UEV2)
#define IS_TM_INT_TEV(x)   (x == TM_INT_TEV)
#define IS_TM_INT_BRKEV(x) (x == TM_INT_BRKEV)
#define IS_TM_GET_INT(x)   (IS_TM_INT_CH0CC(x) || \
                            IS_TM_INT_CH1CC(x) || \
                            IS_TM_INT_CH2CC(x) || \
                            IS_TM_INT_CH3CC(x) || \
                            IS_TM_INT_UEV(x)   || \
                            IS_TM_INT_UEV2(x)  || \
                            IS_TM_INT_TEV(x)   || \
                            IS_TM_INT_BRKEV(x))

/**
 * @brief Used to check parameter of the TM STI selection.
 */
#define IS_TM_TRSEL(x)     ((x == TM_TRSEL_UEVG)   || \
                            (x == TM_TRSEL_TI0S0)  || \
                            (x == TM_TRSEL_TI1S1)  || \
                            (x == TM_TRSEL_ETIF)   || \
                            (x == TM_TRSEL_TI0BED) || \
                            IS_TRSEL_ITI0(x)       || \
                            IS_TRSEL_ITI1(x)       || \
                            IS_TRSEL_ITI2(x))
/**
 * @brief Used to check parameter of the ITI.
 */
#define IS_TM_ITI(x)  ((x == TM_TRSEL_ITI0) || (x == TM_TRSEL_ITI1) || (x == TM_TRSEL_ITI2))

/**
 * @brief Used to check parameter of the TM_TRSEL for \ref TM_ChExternalClockConfig function.
 */
#define IS_TM_TRSEL_CH(x)  ((x == TM_TRSEL_TI0S0) || (x == TM_TRSEL_TI1S1) || \
                              (x == TM_TRSEL_TI0BED))
/**
 * @brief Used to check parameter of the TM ETI polarity.
 */
#define IS_TM_ETIPOL(x) ((x == TM_ETIPOL_NONINVERTED) || (x == TM_ETIPOL_INVERTED))
/**
 * @brief Used to check parameter of the TM prescaler reload time.
 */
#define IS_TM_PSC_RLD(x) ((x == TM_PSC_RLD_UPDATE) || (x == TM_PSC_RLD_IMMEDIATE))
/**
 * @brief Used to check parameter of the forced action.
 */
#define IS_TM_OM_FORCED(x) ((x == TM_OM_FORCED_ACTIVE) || (x == TM_OM_FORCED_INACTIVE))
/**
 * @brief Used to check parameter of the decoder mode.
 */
#define IS_TM_SMSEL_DECODER(x)  ((x == TM_SMSEL_DECODER1) || (x == TM_SMSEL_DECODER2) || \
                                   (x == TM_SMSEL_DECODER3))
/**
 * @brief Used to check parameter of the event.
 */
#define IS_TM_EVENT(x)  (((x & 0xFFFFFAF0) == 0x0000) && (x != 0x0000))
/**
 * @brief Used to check parameter of the TM master mode selection.
 */
#define IS_TM_MMSEL_RESET(x)   (x == TM_MMSEL_RESET)
#define IS_TM_MMSEL_ENABLE(x)  (x == TM_MMSEL_ENABLE)
#define IS_TM_MMSEL_UPDATE(x)  (x == TM_MMSEL_UPDATE)
#define IS_TM_MMSEL_CH0CC(x)   (x == TM_MMSEL_CH0CC)
#define IS_TM_MMSEL_CH0OREF(x) (x == TM_MMSEL_CH0OREF)
#define IS_TM_MMSEL_CH1OREF(x) (x == TM_MMSEL_CH1OREF)
#define IS_TM_MMSEL_CH2OREF(x) (x == TM_MMSEL_CH2OREF)
#define IS_TM_MMSEL_CH3OREF(x) (x == TM_MMSEL_CH3OREF)

